<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Generates a package for Cisco Webex Meetings.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.webexmeetings</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Cisco Webex Meetings</string>
       <key>VENDOR</key>
       <string>Cisco</string>
       <key>SOFTWARETITLE</key>
       <string>Cisco Webex Meetings</string>
       <key>PKGNAME</key>
       <string>Cisco_Webex_Meetings.pkg</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.webexmeetings</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/%PKGNAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Cisco_Webex_Meetings.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Cisco Webex Meetings.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%PKGNAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
