<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DisplayLink USB Graphics Software.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.download.displaylinkdrivers</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>DisplayLink USB Graphics Software</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.displaylink.com/downloads/macos</string>
                <key>re_pattern</key>
                <string>href="/downloads/file\?id=([^"]*)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
               <key>curl_opts</key>
                <array>
                    <string>-F</string>
                    <string>fileId=%match%</string>
                    <string>-F</string>
                    <string>accept_submit=Accept</string>
                    <string>--location</string>
                </array>
              <key>url</key>
              <string>https://www.displaylink.com/downloads/file?id=%match%</string>
              <key>filename</key>
              <string>%NAME%.dmg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/DisplayLink Software Installer.pkg</string>
              <key>expected_authority_names</key>
              <array>
                  <string>Developer ID Installer: DisplayLink Corp (73YQY62QM3)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
