<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Packages latest version of Skype.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.microsoft.skype</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Microsoft Skype</string>
      <key>VENDOR</key>
      <string>Microsoft</string>
      <key>SOFTWARETITLE</key>
      <string>Skype</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.microsoft.skype</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%pathname%/Skype.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>AppPkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>app_path</key>
          <string>%pathname%/Skype.app</string>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
