<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest version of Wireshark.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.wireshark32</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Wireshark 3.2</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.wireshark32</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Wireshark.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>app_path</key>
                <string>%pathname%/Wireshark.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
