<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest version of Adobe Acrobat DC.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.pkg.acrobatdc</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Adobe Acrobat Pro DC</string>
       <key>VENDOR</key>
       <string>Adobe</string>
       <key>SOFTWARETITLE</key>
       <string>Adobe Acrobat Pro DC</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>CATEGORY</key>
       <string>Productivity</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.download.AdobeAcrobatReaderDCUpdates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
