<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of NoMAD and it's launch agent.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.download.jamf.nomad</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>NoMAD</string>
       <key>VENDOR</key>
       <string>NoMAD</string>
       <key>SOFTWARETITLE</key>
       <string>NoMAD</string>
       <key>binary_url</key>
       <string>https://files.nomad.menu/NoMAD.zip</string>
       <key>launchagent_url</key>
       <string>https://files.nomad.menu/NoMAD-LaunchAgent.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%binary_url%</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%launchagent_url%</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/NoMAD.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%RECIPE_CACHE_DIR%/unpack/NoMAD.app</string>
              <key>strict_verification</key>
              <true/>
              <key>requirement</key>
              <string>anchor apple generic and identifier "com.trusourcelabs.NoMAD" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AAPZK3CB24)</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/NoMAD-LaunchAgent.pkg</string>
              <key>expected_authority_names</key>
              <array>
                 <string>Developer ID Installer: Joel Rennich (AAPZK3CB24)</string>
                 <string>Developer ID Certification Authority</string>
                 <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
