<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot) - Modified by JC</string>
	<key>Description</key>
	<string>Downloads the latest version of Webex and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.hitachivantara.pkg.webex</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Webex</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hitachivantara.download.webex</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
					<key>inut_plist_path</key>
					<string>%pathname%/Webex.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>			
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>app_path</key>
					<string>%pathname%/Webex.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
