<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest version of GitHub Desktop.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jss.githubdesktop</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>GitHub Desktop</string>
       <key>VENDOR</key>
       <string>GitHub</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>category</key>
       <string>Developer Tools</string>
   </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.pkg.githubdesktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
