<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest version of VLC.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.jss.vlc</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>VLC</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>CATEGORY</key>
       <string>Video</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ubiquitouschris.pkg.vlc</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
            <dict>
                <key>CATEGORY</key>
                <string>%CATEGORY%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
