<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Microsoft Word.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jss.microsoft.word</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Microsoft Word 365</string>
       <key>VENDOR</key>
       <string>Microsoft</string>
       <key>SOFTWARETITLE</key>
       <string>Word</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>category</key>
       <string>Microsoft Office</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.pkg.microsoft.word</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
