<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Jabra Direct.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.jabradirect</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Jabra Direct</string>
       <key>url</key>
       <string>https://jabraxpressonlineprdstor.blob.core.windows.net/jdo/JabraDirectSetup.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/JabraDirectSetup.pkg</string>
              <key>expected_authority_names</key>
              <array>
                  <string>Developer ID Installer: GN Audio AS (55LV32M29R)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
