<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Uploads the latest version of Jabra Direct to Jamf Pro.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jamf.jabradirect</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Jabra Direct</string>
      <key>VENDOR</key>
      <string>Jabra</string>
      <key>SOFTWARETITLE</key>
      <string>Jabra Direct</string>
      <key>prod_name</key>
      <string>%NAME%</string>
      <key>CATEGORY</key>
      <string>Social Networking</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.jabradirect</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>flat_pkg_path</key>
          <string>%pathname%/JabraDirectSetup.pkg</string>
        </dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/JabraDirectSetup.unsigned.pkg/Payload</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>source_path</key>
          <string>%pathname%/JabraDirectSetup.pkg</string>
        </dict>
        <key>Processor</key>
        <string>Copier</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
        </dict>
        <key>Processor</key>
        <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_category</key>
          <string>%CATEGORY%</string>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
            <string>%RECIPE_CACHE_DIR%/payload</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
