<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest version of TeamViewer.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.TeamViewer15v2</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>TeamViewer 15</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.TeamViewer15v2</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>flat_pkg_path</key>
          <string>%pathname%/Install TeamViewer.app/Contents/Resources/Install TeamViewer.pkg</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
          <key>pkgdirs</key>
          <dict/>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgPayloadUnpacker</string>
          <key>Arguments</key>
          <dict>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Versioner</string>
          <key>Arguments</key>
          <dict>
            <key>plist_version_key</key>
            <string>CFBundleVersion</string>
            <key>input_plist_path</key>
            <string>%RECIPE_CACHE_DIR%/payload/TeamViewer.app/Contents/Info.plist</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PkgCopier</string>
          <key>Arguments</key>
          <dict>
            <key>source_pkg</key>
            <string>%flat_pkg_path%</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/TeamViewer-%version%.pkg</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <array>
              <string>%RECIPE_CACHE_DIR%/unpack</string>
              <string>%RECIPE_CACHE_DIR%/payload</string>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
