<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Netskope.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.Netskope</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Netskope</string>
       <key>VENDOR</key>
       <string>Netskope</string>
       <key>SOFTWARETITLE</key>
       <string>Netskope</string>
       <key>TENANT_NAME</key>
       <string>hitachivantara</string>
       <key>TENANT_URL</key>
       <string>https://download-%TENANT_NAME%.eu.goskope.com/dlr/mac/get</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%TENANT_URL%</string>
              <key>filename</key>
              <string>%NAME%.pkg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%</string>
              <key>expected_authority_names</key>
              <array>
                 <string>Developer ID Installer: netSkope, Inc. (24W52P9M7W)</string>
                 <string>Developer ID Certification Authority</string>
                 <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
