<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of BlueJeans.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.bluejeans</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>BlueJeans</string>
        <key>APP_NAME</key>
        <string>BlueJeansInstaller</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <!---
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.bluejeans.com/downloads</string>
                <key>re_pattern</key>
                <string>https://swdl.bluejeans.com/desktop-app/mac/*/*/BlueJeansInstaller(x86_64).dmg</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
        --->
         <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>https://swdl.bluejeans.com/desktop-app/mac/2.29.0/2.29.0.140/BlueJeansInstaller(x86_64).dmg</string>
              <key>filename</key>
              <string>BlueJeansInstaller(x86_64).dmg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/%APP_NAME%</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key> 
              <string>identifier "com.deusty.CocoaLumberjack" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HE4P42JBGN</string> 
           </dict>
        </dict>
    </array>
</dict>
</plist>
