<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of  Skype for Business.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.jss.microsoft.sfb</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Skype for Business</string>
       <key>VENDOR</key>
       <string></string>
       <key>SOFTWARETITLE</key>
       <string>Skype for Business</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>CATEGORY</key>
       <string>Social Networking</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ubiquitouschris.pkg.microsoft.sfb</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
