<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads updates for Acrobat Reader DC. Set MAJOR_VERSION to "Acrobat2015" to download the 'Classic Track' updates for acrobat DC instead of the Continuous track.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.adobereaderdcupdates</string>
    <key>Input</key>
    <dict>
      <key>LANGUAGE</key>
      <string>English</string>
      <key>MAJOR_VERSION</key>
      <string>AcrobatDC</string>
      <key>NAME</key>
      <string>Adobe Acrobat Reader DC Continuous</string>
      <key>OS_VERSION</key>
      <string>10.13.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>language</key>
          <string>%LANGUAGE%</string>
          <key>major_version</key>
          <string>%MAJOR_VERSION%</string>
          <key>os_version</key>
          <string>%OS_VERSION%</string>
        </dict>
        <key>Processor</key>
        <string>com.github.autopkg.novaksam-recipes.Processors/AdobeAcrobatReaderDcUpdateInfoProvider</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%.dmg</string>
        </dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Adobe Inc. (JQ525L2MZD)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
          <key>input_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
