<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Cisco Webex Meetings.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.webexmeetings</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Cisco Webex Meetings</string>
       <key>VENDOR</key>
       <string>Cisco</string>
       <key>SOFTWARETITLE</key>
       <string>Cisco Webex Meetings</string>
       <key>DOWNLOADURL</key>
       <string>https://akamaicdn.webex.com/client/webexapp.dmg</string>
       <key>PKGNAME</key>
       <string>Cisco_Webex_Meetings.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%DOWNLOADURL%</string>
              <key>filename</key>
              <string>webexapp.dmg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/%PKGNAME%</string>
              <key>expected_authority_names</key>
              <array>
                 <string>Developer ID Installer: Cisco (DE8Y96K9QP)</string>
                 <string>Developer ID Certification Authority</string>
                 <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
