<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest version of oom Plugin for Microsoft Outlook..</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jss.zoomosp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zoom Plugin for Microsoft Outlook</string>
        <key>VENDOR</key>
        <string>Zoom</string>
        <key>SOFTWARETITLE</key>
        <string>Zoom Plugin for Microsoft Outlook</string>
        <key>prod_name</key>
        <string>%NAME%</string>
        <key>CATEGORY</key>
        <string>Utilities</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.pkg.zoomosp</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
