<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of PowerShell.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.pkg.PowerShell</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>PowerShell</string>
       <key>VENDOR</key>
       <string>Microsoft</string>
       <key>SOFTWARETITLE</key>
       <string>PowerShell</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ubiquitouschris.download.PowerShell</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
