<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current Adobe Acrobat Reader DC pkg and repackages, replacing a problematic preinstall script,and enabling installation on non-boot volumes.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.adobereaderdc</string>
    <key>Input</key>
    <dict>
      <key>LANGUAGE</key>
      <string>English</string>
      <key>MAJOR_VERSION</key>
      <string>AcrobatDC</string>
      <key>NAME</key>
      <string>Adobe Acrobat Reader DC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.AdobeReaderDC</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Adobe Inc. (JQ525L2MZD)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
          <key>input_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/UNPACK</string>
          <key>flat_pkg_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/UNPACK/application.pkg/Payload</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Adobe Acrobat Reader DC.app/Contents/Info.plist</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/PAYLOAD/Adobe Acrobat Reader DC.app/Contents/Info.plist</string>
        </dict>
        <key>Processor</key>
        <string>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>source_pkg</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
      </dict>
    </array>
  </dict>
</plist>
