<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>For OS_VERSION, 'Mac OS 10.14.0' or 'Mac OS 10.15.0' are valid, not 10.14 or 10.15</string>
    <key>Description</key>
    <string>Downloads the latest Adobe Acrobat Reader DC.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.adobereaderdc</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>AdobeReaderDC</string>
      <key>OS_VERSION</key>
      <string>Mac OS 10.14.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>os_version</key>
          <string>%OS_VERSION%</string>
        </dict>
        <key>Processor</key>
        <string>AdobeReaderURLProvider</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Adobe Inc. (JQ525L2MZD)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
          <key>input_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
    </array>
  </dict>
</plist>
