<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Brave Browser.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.bravebrowser</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Brave-Browser</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>https://laptop-updates.brave.com/latest/osx</string>
              <key>filename</key>
              <string>%NAME%.dmg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/Brave Browser.dmg</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key>
              <string>identifier "com.brave.Browser" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KL8N8XSYF4</string>
           </dict>
        </dict>
    </array>
</dict>
</plist>
