<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Python.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.python3</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Python 3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.python.org/downloads</string>
                <key>re_pattern</key>
                <string>href="(https:\/\/www.python.org/ftp/python/*[\d.]+/python-*[\d.]+-macosx10.9.pkg)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%match%</string>
              <key>filename</key>
              <string>%NAME%.pkg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%</string>
              <key>expected_authority_names</key>
              <array>
                  <string>Developer ID Installer: Ned Deily (DJ3H93M7VJ)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
