<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages latest version of ForeScout SecureConnector.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.forescout.secureconnector</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>ForeScout SecureConnector</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.forescout.secureconnector</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Update/ForeScout SecureConnector.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>tmp/forescout</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Update</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/tmp/forescout/Update</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>com.hitachivantara.Forescout.SecureConnector</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
