<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest version of TeamViewer 15.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.TeamViewer15</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>TeamViewer</string>
      <key>DOWNLOAD_URL</key>
      <string>https://download.teamviewer.com/download/TeamViewer.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%DOWNLOAD_URL%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%pathname%/Install TeamViewer.app/Contents/Resources/Install TeamViewer.pkg</string>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: TeamViewer Germany GmbH (H7UGFBUGV6)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
