<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest version of TeamViewer.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.TeamViewer15</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>TeamViewer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.TeamViewer15</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
          <key>Arguments</key>
          <dict>
            <key>flat_pkg_path</key>
            <string>%pathname%/Install TeamViewer.app/Contents/Resources/Install TeamViewer.pkg</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
          </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
          <key>pkgdirs</key>
          <dict/>
        </dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
      </dict>
      <dict>
        <key>Comment</key>
        <string>TeamViewer installs in /Applications/TeamViewer.app so extract accordingly</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
        </dict>
        <key>Processor</key>
        <string>PBXZPayloadUnpacker</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>faux_root</key>
          <string>%RECIPE_CACHE_DIR%/payload/root</string>
          <key>installs_item_paths</key>
          <array>
            <string>/Applications/TeamViewer.app</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict/>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>info_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewer.app</string>
        </dict>
        <key>Processor</key>
        <string>PlistReader</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
            <string>%RECIPE_CACHE_DIR%/payload</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>source_pkg</key>
          <string>%pathname%/Install TeamViewer.app/Contents/Resources/Install TeamViewer.pkg</string>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
      </dict>
    </array>
  </dict>
</plist>
