<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Upload latest version of Airtame to JSS.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jss.airtame</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Airtame</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>category</key>
       <string>Utilities</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.1</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.pkg.airtame</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
