<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Node.js.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.nodejs</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Node.js</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.nodejs</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://nodejs.org/en/download/current/</string>
                <key>re_pattern</key>
                <!-- <string>href="(https:\/\/www.python.org/ftp/python/*[\d.]+/python-*[\d.]+-macosx10.9.pkg)"</string> -->
                <string>href="https://nodejs.org/dist/v*([\d.]+)/"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
