<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of FileZilla Client.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.filezilla</string>
    <key>Input</key>
    	<dict>
    		<key>NAME</key>
    		<string>FileZilla</string>
    		<key>RE_PATTERN</key>
    		<string>href="(?P&lt;url&gt;http[s]?.*?(?P&lt;filename&gt;FileZilla_(?P&lt;version&gt;[\d.]+)_macosx.*?\.app\.tar\.bz2).*?)\)"</string>
    	</dict>
    	<key>MinimumVersion</key>
    	<string>1.0.0</string>
    	<key>Process</key>
    	<array>
    		<dict>
    			<key>Arguments</key>
    			<dict>
    				<key>re_pattern</key>
    				<string>%RE_PATTERN%</string>
    				<key>url</key>
    				<string>https://filezilla-project.org/download.php?show_all=1</string>
    			</dict>
    			<key>Processor</key>
    			<string>URLTextSearcher</string>
    		</dict>
    		<dict>
    			<key>Processor</key>
    			<string>URLDownloader</string>
    		</dict>
    		<dict>
    			<key>Processor</key>
    			<string>EndOfCheckPhase</string>
    		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%RECIPE_CACHE_DIR%/unzip/FileZilla.app</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key>
              <string>identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N"</string>
           </dict>
        </dict>
    </array>
</dict>
</plist>
