<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Packages the latest version of FileZilla Client.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.filezilla</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>FileZilla Client</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.filezilla</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PlistReader</string>
        <key>Arguments</key>
        <dict>
          <key>info_path</key>
          <string>%RECIPE_CACHE_DIR%/unzip/FileZilla.app/Contents/Info.plist</string>
          <key>plist_keys</key>
          <dict>
            <key>CFBundleVersion</key>
            <string>version</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>AppPkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
          <key>app_path</key>
          <string>%RECIPE_CACHE_DIR%/unzip/FileZilla.app</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileMover</string>
        <key>Arguments</key>
        <dict>
          <key>source</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
          <key>target</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
          <key>path_list</key>
          <array>
            <string>%RECIPE_CACHE_DIR%/unzip</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
