<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads latest version of WhatsApp.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.jss.whatsapp</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>WhatsApp</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>category</key>
       <string>Social Networking</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ubiquitouschris.pkg.whatsapp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
