<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Amazon Redshift ODBC driver.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.pkg.AmazonRedshiftODBCDriver</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Amazon Redshift ODBC driver</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.AmazonRedshiftODBCDriver</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://docs.aws.amazon.com/redshift/latest/mgmt/configure-odbc-connection.html</string>
                <key>re_pattern</key>
                <string>href="https://s3.amazonaws.com/redshift-downloads/drivers/odbc/([^""]*)/AmazonRedshiftODBC-[^""]*.dmg"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
