<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Skype.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.skype</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Skype</string>
       <key>VENDOR</key>
       <string>Microsoft</string>
       <key>SOFTWARETITLE</key>
       <string>Skype</string>
       <key>url</key>
       <string>https://go.skype.com/mac.download</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>skype.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Skype.app</string>
                <key>requirement</key>
                <string>identifier "com.skype.skype" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AL798K98FX</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
