<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Sublime Text 4</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.sublimetext4</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>SublimeText4</string>
      <key>SEARCH_URL</key>
      <string>https://www.sublimetext.com/download_thanks?target=mac</string>
      <key>SEARCH_PATTERN</key>
      <string>&lt;a href="(https:\/\/download\.sublimetext\.com\/sublime_text_build_[0-9a-zA-Z]*_mac\.zip)"&gt;</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%SEARCH_URL%</string>
          <key>re_pattern</key>
          <string>%SEARCH_PATTERN%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%match%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/Sublime Text.app</string>
          <key>requirement</key>
          <string>identifier "com.sublimetext.4" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z6D26JE4Y4</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
    </array>
  </dict>
</plist>
