<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of zoom.us.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.jss.zoom.us</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>zoom.us</string>
       <key>VENDOR</key>
       <string>Zoom</string>
       <key>SOFTWARETITLE</key>
       <string>zoom.us</string>
       <key>prod_name</key>
       <string>%NAME%</string>
       <key>CATEGORY</key>
       <string>Social Networking</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hitachivantara.download.zoom.us</string>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/payload</string>
               <key>pkg_payload_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack/zoomus.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
        <key>Arguments</key>
        <dict>
           <key>input_plist_path</key>
           <string>%RECIPE_CACHE_DIR%/payload/zoom.us.app/Contents/Info.plist</string>
           <key>plist_version_key</key>
           <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
     </dict>
     <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
           <key>source_pkg</key>
           <string>%pathname%</string>
           <key>pkg_path</key>
           <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
     </dict>
     <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
           <key>path_list</key>
           <array>
              <string>%RECIPE_CACHE_DIR%/unpack</string>
              <string>%RECIPE_CACHE_DIR%/payload</string>
           </array>
        </dict>
     </dict>
     <dict>
         <key>Arguments</key>
         <dict>
             <key>category</key>
             <string>%CATEGORY%</string>
             <key>pkg_path</key>
             <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
         </dict>
         <key>Processor</key>
         <string>JSSImporter</string>
     </dict>
    </array>
</dict>
</plist>
