<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Zoom Plugin for Microsoft Outlook.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.zoomosp</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Zoom Plugin for Microsoft Outlook</string>
       <key>VENDOR</key>
       <string>Zoom</string>
       <key>SOFTWARETITLE</key>
       <string>Zoom Plugin for Microsoft Outlook</string>
       <key>DOWNLOADURL</key>
       <string>https://zoom.us/client/latest/ZoomMacOutlookPlugin.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>%DOWNLOADURL%</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%</string>
              <key>expected_authority_names</key>
              <array>
                 <string>Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)</string>
                 <string>Developer ID Certification Authority</string>
                 <string>Apple Root CA</string>
              </array>
           </dict>
        </dict>
    </array>
</dict>
</plist>
