<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Tunnelblick.</string>
    <key>Identifier</key>
    <string>com.github.ubiquitouschris.download.tunnelblick</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Tunnelblick</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://tunnelblick.net/downloads.html</string>
                <key>re_pattern</key>
                <string>href="/(release/Tunnelblick_*[\d.]+_build_5[^"]*.dmg)"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>URLDownloader</string>
           <key>Arguments</key>
           <dict>
              <key>url</key>
              <string>https://tunnelblick.net/%match%</string>
              <key>filename</key>
              <string>%NAME%.dmg</string>
           </dict>
        </dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/Tunnelblick.app</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key>
              <string>identifier "net.tunnelblick.tunnelblick" and anchor apple generic and certificate leaf[subject.OU] = Z2SG5H3HC8</string>
           </dict>
        </dict>
    </array>
</dict>
</plist>
