<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Tunnelblick.</string>
    <key>Identifier</key>
    <string>com.github.hitachivantara.download.tunnelblick</string>
    <key>Input</key>
    <dict>
       <key>NAME</key>
       <string>Tunnelblick</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>release/Tunnelblick_(?P&lt;version&gt;[\d\.]+[a-z]?)_build_(?P&lt;build&gt;[\d\.]+)\.dmg</string>
				<key>url</key>
				<string>https://tunnelblick.net/downloads.html</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>https://tunnelblick.net/release/Tunnelblick_%version%_build_%build%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
           <key>Processor</key>
           <string>EndOfCheckPhase</string>
        </dict>
        <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/Tunnelblick.app</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key>
              <string>identifier "net.tunnelblick.tunnelblick" and anchor apple generic and certificate leaf[subject.OU] = Z2SG5H3HC8</string>
           </dict>
        </dict>
    </array>
</dict>
</plist>
